# Используем официальный образ Python как основу.
FROM python:3.11-slim

# Устанавливаем рабочую директорию внутри контейнера.
WORKDIR /app

# Копируем файл с зависимостями.
COPY requirements.txt .

# Устанавливаем зависимости.
RUN pip install --no-cache-dir -r requirements.txt

# Копируем код приложения (содержимое папки ./app)
# в ТЕКУЩУЮ рабочую директорию (которая /app).
COPY ./app .

# Указываем Docker, какую команду запустить.
# Так как main.py теперь лежит прямо в /app, путь к модулю - просто 'main'.
CMD ["python", "-m", "uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]